In [1]:
import pandas as pd

# dataset from https://www.kaggle.com/code/startupsci/titanic-data-science-solutions

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
for i in range(df.shape[1]):
    print(df.columns[i],'->',df.iloc[:,i].isnull().any())

PassengerId -> False
Survived -> False
Pclass -> False
Name -> False
Sex -> False
Age -> True
SibSp -> False
Parch -> False
Ticket -> False
Fare -> False
Cabin -> True
Embarked -> True

In [84]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [85]:
df.shape

(891, 12)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [31]:
for i in range(df.shape[1]):
    print(df.columns[i],"->",len(df.iloc[:,i].unique()),"->",df.iloc[:,i].dtypes)

PassengerId -> 891 -> int64
Survived -> 2 -> int64
Pclass -> 3 -> int64
Name -> 891 -> object
Sex -> 2 -> object
Age -> 89 -> float64
SibSp -> 7 -> int64
Parch -> 7 -> int64
Ticket -> 681 -> object
Fare -> 248 -> float64
Cabin -> 148 -> object
Embarked -> 4 -> object

In [48]:
print(df['Embarked'].mode())

0    S
dtype: object

In [87]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
gender=list(df['Sex'].unique())
embark = list(df['Embarked'].unique())
embark

['S', 'C', 'Q', nan]

In [39]:
def gender_convert(x):
    
    return gender.index(x)

In [47]:
df['Sex']=df['Sex'].apply(gender_convert)

df['Embarked']=df['Embarked'].fillna(df['Embarked'].mode())

df['Age']=df['Age'].fillna(float(df['Age'].mode()))
df['Age']=df['Age'].astype(int)

df['Fare']=df['Fare'].fillna(float(df['Fare'].mode()))
df['Fare']=df['Fare'].astype(int)

df.head()

ValueError: 0 is not in list

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int64
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    int32
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: int32(2), int64(6), object(4)
memory usage: 76.7+ KB